## Staging: buckets 🪣
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 20 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| add    | `aws_s3_bucket_policy.athena_bucket`                               |
|        | `aws_s3_bucket_policy.curated_bucket`                              |
|        | `aws_s3_bucket_policy.raw_bucket`                                  |
|        | `aws_s3_bucket_policy.transformed_bucket`                          |
|        | `module.athena_bucket.aws_s3_bucket.this`                          |
|        | `module.athena_bucket.aws_s3_bucket_public_access_block.this`      |
|        | `module.curated_bucket.aws_s3_bucket.this`                         |
|        | `module.curated_bucket.aws_s3_bucket_public_access_block.this`     |
|        | `module.glue_bucket.aws_s3_bucket.this`                            |
|        | `module.glue_bucket.aws_s3_bucket_public_access_block.this`        |
|        | `module.log_bucket.aws_s3_bucket.this`                             |
|        | `module.log_bucket.aws_s3_bucket_acl.this`                         |
|        | `module.log_bucket.aws_s3_bucket_ownership_controls.this`          |
|        | `module.log_bucket.aws_s3_bucket_policy.this`                      |
|        | `module.log_bucket.aws_s3_bucket_public_access_block.this`         |
|        | `module.log_bucket.aws_s3_bucket_versioning.this`                  |
|        | `module.raw_bucket.aws_s3_bucket.this`                             |
|        | `module.raw_bucket.aws_s3_bucket_public_access_block.this`         |
|        | `module.transformed_bucket.aws_s3_bucket.this`                     |
|        | `module.transformed_bucket.aws_s3_bucket_public_access_block.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.athena_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena_bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "SupersetReadWrite"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-operations_aws_production",
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_gc_forms_production",
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_support_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-bes_crm_salesforce_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-operations_aws_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_forms_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_notify_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_support_production",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.curated_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "curated_bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "SupersetRead"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-operations_aws_production",
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_gc_forms_production",
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_support_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-bes_crm_salesforce_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-operations_aws_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_forms_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_notify_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_support_production",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.raw_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "raw_bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketVersioning",
              + "s3:List*",
              + "s3:PutBucketVersioning",
              + "s3:PutObject",
              + "s3:ReplicateDelete",
              + "s3:ReplicateObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "ReplicateToBucket"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::563894450011:role/SalesforceReplicateToDataLake",
                  + "arn:aws:iam::659087519042:role/BillingExtractTags",
                  + "arn:aws:iam::659087519042:role/CostUsageReplicateToDataLake",
                  + "arn:aws:iam::957818836222:role/FormsS3ReplicatePlatformDataLake",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject*",
              + "s3:GetBucketLocation",
              + "s3:GetObject*",
              + "s3:ListBucket",
              + "s3:PutObject*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "RDSExportToBucket"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:role/NotifyExportToPlatformDataLake",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.transformed_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "transformed_bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "SupersetRead"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-operations_aws_production",
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_gc_forms_production",
                  + "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_support_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-bes_crm_salesforce_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-operations_aws_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_forms_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_notify_production",
                  + "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_support_production",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket_policy.athena_bucket will be created
  + resource "aws_s3_bucket_policy" "athena_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.curated_bucket will be created
  + resource "aws_s3_bucket_policy" "curated_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.raw_bucket will be created
  + resource "aws_s3_bucket_policy" "raw_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.transformed_bucket will be created
  + resource "aws_s3_bucket_policy" "transformed_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.athena_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-data-lake-athena-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire_all"

          + expiration {
              + days = 30
            }
        }
      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"

          + noncurrent_version_expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "athena/"
        }

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # module.athena_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.curated_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-data-lake-curated-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"

          + noncurrent_version_expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "curated/"
        }

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # module.curated_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.glue_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-data-lake-glue-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"

          + noncurrent_version_expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "glue/"
        }

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # module.glue_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.log_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cds-data-lake-bucket-logs-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "true"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire_all"

          + expiration {
              + days = 30
            }
        }
      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"
        }

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.log_bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.log_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.log_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.log_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.log_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.raw_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-data-lake-raw-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"

          + noncurrent_version_expiration {
              + days = 30
            }
        }
      + lifecycle_rule {
          + enabled = true
          + id      = "transition_storage"

          + transition {
              + days          = 180
              + storage_class = "GLACIER"
                # (1 unchanged attribute hidden)
            }
          + transition {
              + days          = 90
              + storage_class = "STANDARD_IA"
                # (1 unchanged attribute hidden)
            }
        }
      + lifecycle_rule {
          + enabled = true
          + id      = "expire_gc_notify"
          + prefix  = "platform/gc-notify/"

          + expiration {
              + days = 3
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "raw/"
        }

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # module.raw_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.transformed_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-data-lake-transformed-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformDataLake"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"

          + noncurrent_version_expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "transformed/"
        }

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # module.transformed_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + athena_bucket_arn       = (known after apply)
  + athena_bucket_name      = (known after apply)
  + curated_bucket_arn      = (known after apply)
  + curated_bucket_name     = (known after apply)
  + glue_bucket_arn         = (known after apply)
  + glue_bucket_name        = (known after apply)
  + raw_bucket_arn          = (known after apply)
  + raw_bucket_name         = (known after apply)
  + transformed_bucket_arn  = (known after apply)
  + transformed_bucket_name = (known after apply)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 22 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
